Autodesk.Revit.DB.FilteredWorksetCollector.GetWorksetIteratorInternal
Returns a FilteredWorksetIterator to the worksets passing the filters.
Remarks:
Calling this when you have an active iterator to this same collector will result in the first iterator being
stopped by this call. Once you've used the collector to get another iterator or set of passing worksets, the original open iterator is defunct and can't be used again, attempts to call moveNext() or to reset it will throw exceptions.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The collector does not have a filter applied.  Extraction or iteration of worksets is not permitted without a filter.
Since:
2012

Autodesk.Revit.DB.FilteredWorksetCollector.GetEnumerator
Returns an enumerator that iterates through the collection.
Returns: An IEnumerator(Autodesk.Revit.DB.Workset) object that can be used to iterate through the collection.